Tekla.Structures.ModelInternal.Operation.SharingOperationEnum
Sharing operations.

Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.MAKE_MODEL_SHAREABLE


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.WRITEOUT_PACKET


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.WRITEOUT_COMMIT


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.READIN_STARTING


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.READIN_PACKET


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.READIN_COMMIT


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.READIN_CHANGES


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.MODULE_BASELINES


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.UI_SET_MENU


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.SAVE_VERSION_GUID


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.GET_VERSION_GUID


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.GET_VERSION_PACKET


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.LOG_BASIC


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.LOG_INFORMATION


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.LOG_WARNING


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.LOG_ERROR


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.COMMAND_RESULT


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.REGISTER_MODELSHARING_PLUGIN


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.CREATE_STARTSHARING_BACKUP


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.RESTORE_STARTSHARING_BACKUP


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.IS_SHARING_ENABLED


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.IS_MODEL_IMPORT_ENABLED


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.LICENCE_INFO


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.SET_USER_MODEL_ROLE


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.JOIN_OPEN_MODEL


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.JOIN_FINISHED


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.PUSH_MODULE_BASELINE


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.START_SHARING_COMMIT


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.CHECK_READIN_FILE


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.HISTORY_WRITE_LOCAL


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.IS_PRIVILEGES_INP_OWNER


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.RESTORE_PRIVILEGES_INP


Tekla.Structures.ModelInternal.Operation.SharingOperationEnum.GET_MODEL_LOCAL_HISTORY_FOLDER
